xueliu/nRF51822/nrf51_iot_sdk_0.8.0_f1f6187/Nordic/nrf51/components/iot/coap/coap.c
/* Copyright (c) 2014 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */

#include <stdbool.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf51.h"
#include "coap_api.h"
#include "coap.h"
#include "coap_queue.h"
#include "coap_transport.h"
#include "app_trace.h"
#include "sdk_common.h"
#include "iot_common.h"
#include "ble_ipsp.h"
#include "mem_manager.h"
#include "coap_resource.h"
#include "coap_observe_api.h"
#include "coap_observe.h"

#define COAP_REQUEST_ENTITY_MAX_SIZE (BLE_IPSP_RX_BUFFER_SIZE - (IPV6_IP_HEADER_SIZE + \
                                                                 UDP_HEADER_SIZE))       /** Maximum request entity size. */

SDK_MUTEX_DEFINE(m_coap_mutex)                                                           /**< Mutex variable. Currently unused, this declaration does not occupy any space in RAM. */

static uint32_t              m_token_seed;                                               /**< Token seed provided by application to be used for generating token numbers. */
static uint32_t              m_message_id_counter;                                       /**< Message ID counter, used to generate unique message IDs. */
static coap_error_callback_t m_error_callback;                                           /**< Function pointer to an application CoAP error handler. */

/** Table of ports used for CoAP server and/or client endpoints. */
static const coap_port_t m_coap_port[COAP_PORT_COUNT] =
{
    {COAP_SERVER_PORT},
    {COAP_CLIENT_PORT}
};

#ifdef COAP_AUTOMODE

static uint32_t m_observe_sequence_number = 99;

#endif //#ifdef COAP_AUTOMODE

#define COAP_MESSAGE_ACK_SET(REMOTE, MID) { \
    memcpy(&m_coap_empty_message.remote, (REMOTE), sizeof(coap_remote_t)); \
    m_coap_empty_message.header.id = (MID); \
    m_coap_empty_message.header.type = COAP_TYPE_ACK; \
}

#define COAP_MESSAGE_RST_SET(REMOTE, MID) { \
    memcpy(&m_coap_empty_message.remote, (REMOTE), sizeof(coap_remote_t)); \
    m_coap_empty_message.header.id = (MID); \
    m_coap_empty_message.header.type = COAP_TYPE_RST; \
}

static coap_message_t m_coap_empty_message = {
    .header.version    = 1,
    .header.type       = COAP_TYPE_ACK,
    .header.token_len  = 0,
    .header.code       = COAP_CODE_EMPTY_MESSAGE,
    .header.id         = 0,
    .p_payload         = NULL,
    .payload_len       = 0,
    .options_count     = 0,
    .p_arg             = NULL,
    .response_callback = NULL,
    .port.port_number  = COAP_SERVER_PORT,
    .options_len       = 0,
    .options_offset    = 0,
    .p_data            = NULL,
    .data_len          = 0  
};

static inline bool is_ping(coap_message_t * p_message)
{
    return (p_message->header.code == COAP_CODE_EMPTY_MESSAGE) &&
           (p_message->header.type == COAP_TYPE_CON);
}

static inline bool is_ack(coap_message_t * p_message)
{
    return (p_message->header.code == COAP_CODE_EMPTY_MESSAGE) &&
           (p_message->header.type == COAP_TYPE_ACK);
}

static inline bool is_reset(coap_message_t * p_message)
{
    return (p_message->header.type == COAP_TYPE_RST);
}

static inline bool is_con_response(coap_message_t * p_message)
{
    return (p_message->header.code == COAP_CODE_205_CONTENT) &&
           (p_message->header.type == COAP_TYPE_CON);
}

static inline bool is_request(uint8_t message_code)
{
    return (message_code >= 1) && (message_code < 32);
}

static inline bool is_response(uint8_t message_code)
{
    return (message_code >= 64) && (message_code < 192);
}

static inline void app_error_notify(uint32_t err_code, coap_message_t * p_message)
{
    if (m_error_callback != NULL)
    {
        COAP_MUTEX_UNLOCK();    
        
        m_error_callback(err_code, p_message);

        COAP_MUTEX_LOCK();    
    }
}

uint32_t coap_init(uint32_t token_rand_seed)
{
    COAP_TRC("[COAP]: >> coap_init %lu.\r\n", token_rand_seed);
        
    uint32_t err_code;
    
    SDK_MUTEX_INIT(m_coap_mutex);

    COAP_MUTEX_LOCK();
    
    internal_coap_observe_init();
    
    m_error_callback = NULL;
    
    m_token_seed = token_rand_seed;
    (void)m_token_seed;
    
    m_message_id_counter = 1;
    
    const coap_transport_init_t transport_param =
    {
       COAP_PORT_COUNT,
       (coap_port_t *)m_coap_port
    };

    err_code = coap_transport_init(&transport_param);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }
    err_code = coap_queue_init();
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    err_code = coap_resource_init();

    COAP_MUTEX_UNLOCK();

    COAP_TRC("[COAP]: << coap_init\r\n");

    return err_code;

}

#ifndef COAP_AUTOMODE
uint32_t coap_error_handler_register(coap_error_callback_t error_callback)
{
    // TODO: error handling, null pointer, module initilized etc. 
    COAP_MUTEX_LOCK();

    m_error_callback = error_callback;
    
    COAP_MUTEX_UNLOCK();

    return NRF_SUCCESS;   
}
#endif //#ifndef COAP_AUTOMODE

uint32_t internal_coap_message_send(uint32_t * p_handle, coap_message_t * p_message)
{
    if (p_message == NULL)
    {
        return (NRF_ERROR_NULL | IOT_COAP_ERR_BASE);
    }

    // Compiled away if COAP_ENABLE_OBSERVE_CLIENT is not set to 1.
    coap_observe_client_send_handle(p_message);
        
    COAP_TRC("[COAP]: >> message_send\r\n");

    // Fetch the expected length of the packet serialized by passing length of 0.
    uint16_t expected_length = 0;
    uint32_t err_code = coap_message_encode(p_message, NULL, &expected_length);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    // Allocate a buffer to serialize the message into.
    uint8_t * p_buffer;
    uint32_t request_length = expected_length;
    err_code = nrf51_sdk_mem_alloc(&p_buffer, &request_length);
    if (err_code != NRF_SUCCESS)
    {
        COAP_TRC("[COAP]: p_buffer alloc error = 0x%08lX!\r\n", err_code);
        return err_code;
    }
    memset(p_buffer, 0, request_length);
    COAP_TRC("[COAP]: Alloc mem, p_buffer = %p\r\n", (uint8_t *)p_buffer);

    // Serialize the message.
    uint16_t buffer_length = (uint16_t)request_length;
    err_code = coap_message_encode(p_message, p_buffer, &buffer_length);
    if (err_code != NRF_SUCCESS)
    {
        COAP_TRC("[COAP]: Encode error!\r\n");
        COAP_TRC("[COAP]: Free mem, p_buffer = %p\r\n", p_buffer);
        UNUSED_VARIABLE(nrf51_sdk_mem_free(p_buffer));

        return err_code;
    }

