xueliu/nRF51822/nrf51_iot_sdk_0.8.0_f1f6187/Nordic/nrf51/components/iot/coap/coap.c
    err_code = coap_transport_write(&p_message->port, &p_message->remote, p_buffer, buffer_length);

    if (err_code == NRF_SUCCESS)
    {   
        if (is_request(p_message->header.code) ||
            is_con_response(p_message))
        {
            coap_queue_item_t item;
            item.p_arg         = p_message->p_arg;
            item.mid           = p_message->header.id;
            item.callback      = p_message->response_callback;
            item.p_buffer      = p_buffer;
            item.buffer_len    = buffer_length;
            item.timeout_val   = COAP_ACK_TIMEOUT * COAP_ACK_RANDOM_FACTOR;
            if (p_message->header.type == COAP_TYPE_CON)
            {
                item.timeout       = item.timeout_val;
                item.retrans_count = 0;
            }
            else
            {   
                item.timeout       = COAP_MAX_TRANSMISSION_SPAN;
                item.retrans_count = COAP_MAX_RETRANSMIT_COUNT;
            }
            
            item.port          = p_message->port;
            item.token_len     = p_message->header.token_len;
            memcpy(&item.remote, &p_message->remote, sizeof(coap_remote_t));
            memcpy(item.token, p_message->token, p_message->header.token_len);
            err_code = coap_queue_add(&item);
            if (err_code != NRF_SUCCESS)
            {
                COAP_TRC("[COAP]: Message queue error = 0x%08lX!\r\n", err_code);
                return err_code;
            }
            *p_handle = item.handle;
        }
        else
        {
            *p_handle = COAP_MESSAGE_QUEUE_SIZE;
            
            COAP_TRC("[COAP]: Free mem, p_buffer = %p\r\n", p_buffer);
            UNUSED_VARIABLE(nrf51_sdk_mem_free(p_buffer));
        }
    }
    
    COAP_TRC("[COAP]: << message_send\r\n");

    return err_code;
}


static uint32_t create_response(coap_message_t ** pp_response, coap_message_t * p_request, uint16_t data_size)
{
    uint32_t err_code;
    
    // Allocate space for a new message.
    uint32_t size = sizeof(coap_message_t);
    err_code = nrf51_sdk_mem_alloc((uint8_t **)pp_response, &size);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }
    
    coap_message_t * p_response = (*pp_response);
    
    memset(p_response, 0, sizeof(coap_message_t));
    COAP_TRC("[COAP]: Alloc mem, p_response = %p\r\n", (uint8_t *)p_response);

    if (data_size > 0)
    {
        // Allocate a scratch buffer for payload and options.
        size = data_size;
        err_code = nrf51_sdk_mem_alloc(&(p_response->p_data), &size);
        if (err_code != NRF_SUCCESS)
        {
            return err_code;
        }
        memset(p_response->p_data, 0, size);
        p_response->data_len = size;
        COAP_TRC("[COAP]: Alloc mem, p_response->p_data = %p\r\n", p_response->p_data);
    }
    
    coap_message_conf_t config;
    memset (&config, 0, sizeof(coap_message_conf_t));
    config.token_len = p_request->header.token_len;
    config.id        = p_request->header.id;
    config.code      = COAP_CODE_404_NOT_FOUND;
    config.port.port_number = COAP_SERVER_PORT;
    memcpy(config.token, p_request->token, p_request->header.token_len);
    
    if ((coap_msg_type_t)p_request->header.type == COAP_TYPE_CON)
    {
        config.type = COAP_TYPE_ACK; 
    }
    else
    {
        config.type = (coap_msg_type_t)p_request->header.type; 
    }
    
    err_code = coap_message_create(p_response, &config);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    (void)coap_message_remote_addr_set(p_response, &p_request->remote);
    
    return NRF_SUCCESS;
}


uint32_t coap_transport_read(const coap_port_t    * p_port,
                             const coap_remote_t  * p_remote,
                             uint32_t               result,
                             const uint8_t        * p_data,
                             uint16_t               datalen)
{
    COAP_TRC("[COAP]: >> coap_transport_read\r\n");
    
    // Discard all packets if not success or truncated. 
    if (!(result == NRF_SUCCESS || result == UDP_TRUNCATED_PACKET))  
    {
        return NRF_SUCCESS;
    }
    
    uint32_t err_code;
    coap_message_t * p_message;

    // Allocate space for a new message.
    uint32_t size = sizeof(coap_message_t);
    err_code = nrf51_sdk_mem_alloc((uint8_t **)&p_message, &size);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }
    memset(p_message, 0, sizeof(coap_message_t));
    COAP_TRC("[COAP]: Alloc mem, p_message = %p\r\n", (uint8_t *)p_message);
    
    err_code = coap_message_decode(p_message, p_data, datalen, p_remote);
    if (err_code != NRF_SUCCESS)
    {
        app_error_notify(err_code, p_message);
        
        UNUSED_VARIABLE(nrf51_sdk_mem_free((uint8_t *)p_message));
        return err_code;
    }
    
    if (result == UDP_TRUNCATED_PACKET)
    {
#ifdef COAP_AUTOMODE
        coap_message_t * p_response;
        
        // create a response message.
        err_code = create_response(&p_response, p_message, 4); // 1 option, 1 byte ext delta, potential 2 byte integer for size1.
        if (err_code != NRF_SUCCESS)
        {
            return err_code;
        }
        
        (void)coap_message_opt_uint_add(p_response, COAP_OPT_SIZE1, COAP_REQUEST_ENTITY_MAX_SIZE);
        
        p_response->header.token_len = 0;
        p_response->payload_len      = 0;
        
        // Override 404 code.
        p_response->header.code = COAP_CODE_413_REQUEST_ENTITY_TOO_LARGE;
        p_response->header.type = COAP_TYPE_RST;

        uint32_t msg_handle;
        err_code = internal_coap_message_send(&msg_handle, p_response);
        
        COAP_TRC("[COAP]: Free mem, p_response->p_data = %p\r\n", p_response->p_data);
        UNUSED_VARIABLE(nrf51_sdk_mem_free(p_response->p_data));
        
        COAP_TRC("[COAP]: Free mem, p_response = %p\r\n", (uint8_t *)p_response);
        UNUSED_VARIABLE(nrf51_sdk_mem_free((uint8_t *)p_response));
#else 
        app_error_notify(result, p_message);
#endif //#ifdef COAP_AUTOMODE
        
        COAP_TRC("[COAP]: Free mem, p_message = %p\r\n", (uint8_t *)p_message);
        UNUSED_VARIABLE(nrf51_sdk_mem_free((uint8_t *)p_message));
    }
    else if (is_ping(p_message))
    {
        COAP_MESSAGE_RST_SET(&p_message->remote, p_message->header.id);
            
        uint32_t handle;
        err_code = internal_coap_message_send(&handle, &m_coap_empty_message);
        
        COAP_TRC("[COAP]: Free mem, p_message = %p\r\n", (uint8_t *)p_message);
        UNUSED_VARIABLE(nrf51_sdk_mem_free((uint8_t *)p_message));
    }
    else if (is_ack(p_message) || 
             is_reset(p_message))
    {
        // Populate the token with the one used sending, before passing it to the application.
        coap_queue_item_t * p_item = NULL;
        err_code = coap_queue_item_by_mid_get(&p_item, p_message->header.id);
        
        if (err_code == NRF_SUCCESS)
        {
            if (p_item->callback != NULL)
            {
                // As the token is missing from peer, it will be added before giving it to the application.
                memcpy(p_message->token, p_item->token, p_item->token_len);
                p_message->header.token_len = p_item->token_len;

                // Compiled away if COAP_ENABLE_OBSERVE_CLIENT is not set to 1.
                coap_observe_client_response_handle(p_message, p_item);

                COAP_TRC("[COAP]: >> application callback\r\n");

                COAP_MUTEX_UNLOCK();

                if (is_ack(p_message))
                {
                    p_item->callback(NRF_SUCCESS, p_item->p_arg, p_message);
                }
                else
                {
                    p_item->callback(COAP_TRANSMISSION_RESET_BY_PEER, p_item->p_arg, p_message);
                }

                COAP_MUTEX_LOCK();

                COAP_TRC("[COAP]: << application callback\r\n");
            }
            
            COAP_TRC("[COAP]: Free mem, p_item->p_buffer = %p\r\n", p_item->p_buffer);
            UNUSED_VARIABLE(nrf51_sdk_mem_free(p_item->p_buffer));

            // Remove the queue element, as a match occured.
            err_code = coap_queue_remove(p_item);
        }
        
        COAP_TRC("[COAP]: Free mem, p_message = %p\r\n", (uint8_t *)p_message);
        UNUSED_VARIABLE(nrf51_sdk_mem_free((uint8_t *)p_message));
        
