xueliu/nRF51822/nrf51_iot_sdk_0.8.0_f1f6187/Nordic/nrf51/components/iot/coap/coap.c
    }
    else if (is_response(p_message->header.code))
    {
        COAP_TRC("[COAP]: CoAP message type: RESPONSE\r\n");

        // If this is a CON response, we have to send an ACK on the message id.
        if (p_message->header.type == COAP_TYPE_CON)
        {
            // create an ACK message and add the current MID.
            COAP_MESSAGE_ACK_SET(&p_message->remote, p_message->header.id);
            
            uint32_t handle;
            coap_message_t coap_ack_message = m_coap_empty_message;
            coap_ack_message.port.port_number = p_port->port_number;

            err_code = internal_coap_message_send(&handle, &coap_ack_message);
        }
        
        coap_queue_item_t * p_item;
        err_code = coap_queue_item_by_token_get(&p_item, p_message->token, p_message->header.token_len);
        if (err_code != NRF_SUCCESS)
        {
            // Compiled away if COAP_ENABLE_OBSERVE_CLIENT is not set to 1.
            coap_observe_client_response_handle(p_message, NULL);
            
            UNUSED_VARIABLE(nrf51_sdk_mem_free((uint8_t *)p_message));
            return err_code; 
        }

        if (p_item->callback != NULL)
        {
            // Compiled away if COAP_ENABLE_OBSERVE_CLIENT is not set to 1.
            coap_observe_client_response_handle(p_message, p_item);
            
            COAP_TRC("[COAP]: >> application callback\r\n");

            COAP_MUTEX_UNLOCK();

            p_item->callback(NRF_SUCCESS, p_item->p_arg, p_message);
            
            COAP_MUTEX_LOCK();

            COAP_TRC("[COAP]: << application callback\r\n");
        }
      
        COAP_TRC("[COAP]: Free mem, p_item->p_buffer = %p\r\n", p_item->p_buffer);
        UNUSED_VARIABLE(nrf51_sdk_mem_free(p_item->p_buffer));
        
        err_code = coap_queue_remove(p_item);

        COAP_TRC("[COAP]: Free mem, p_message = %p\r\n", (uint8_t *)p_message);
        UNUSED_VARIABLE(nrf51_sdk_mem_free((uint8_t *)p_message));
        
    }
    else if (is_request(p_message->header.code))
    {
        COAP_TRC("[COAP]: CoAP message type: REQUEST\r\n");

        uint8_t * uri_pointers[COAP_RESOURCE_MAX_DEPTH] = {0, };

        uint8_t uri_path_count = 0;
        uint16_t index;

        for (index = 0; index < p_message->options_count; index++)
        {
            if (p_message->options[index].number == COAP_OPT_URI_PATH)
            {
                uri_pointers[uri_path_count++] = p_message->options[index].p_data;
            }
        }
        
        coap_resource_t * found_resource;
        err_code = coap_resource_get(&found_resource, uri_pointers, uri_path_count);

#ifdef COAP_AUTOMODE
        
        coap_message_t * p_response;        
        
        // create a response message.
        err_code = create_response(&p_response, p_message, COAP_MESSAGE_DATA_MAX_SIZE);
        if (err_code != NRF_SUCCESS)
        {
            return err_code;
        }
        
        // If resource was located.
        if (found_resource != NULL)
        {
            if (found_resource->callback != NULL)
            {
                if (((found_resource->permission) & (1 << ((p_message->header.code) - 1))) > 0) // Has permission for the requested CoAP method.
                {
                    if ((coap_message_opt_present(p_message, COAP_OPT_OBSERVE) == NRF_SUCCESS) &&
                        (p_message->header.code == COAP_CODE_GET))
                    {
                        
                        coap_content_type_t ct_to_use;
                        coap_message_ct_match_select(&ct_to_use, p_message, found_resource);
                        // TODO: error check
                        
                        // Register observer, if successfull, add the Observe option in the reply.
                        uint32_t handle;
                        coap_observer_t observer;
                        
                        // Token Length.
                        observer.token_len            = p_message->header.token_len;
                        // Resource of interest.
                        observer.p_resource_of_interest = found_resource;
                        // Remote.
                        memcpy(&observer.remote, &p_message->remote, sizeof(coap_remote_t));
                        // Token.
                        memcpy(observer.token, p_message->token, observer.token_len);
                       
                        observer.ct = ct_to_use;
                        
                        err_code = internal_coap_observe_server_register(&handle, &observer);
                        
                        if (err_code == NRF_SUCCESS)
                        {
                            err_code = coap_message_opt_uint_add(p_response, COAP_OPT_OBSERVE, m_observe_sequence_number++);
                            
                            err_code = coap_message_opt_uint_add(p_response, COAP_OPT_MAX_AGE, found_resource->expire_time);
                        }
                        
                    }
                      
                    COAP_MUTEX_UNLOCK();
                    
                    // Call resource handler
                    found_resource->callback(found_resource, p_message, p_response);                    
                    
                    COAP_MUTEX_LOCK();
                }
                else
                {
                    p_response->header.code = COAP_CODE_405_METHOD_NOT_ALLOWED;
                }
            }
            else
            {
                p_response->header.code = COAP_CODE_405_METHOD_NOT_ALLOWED;
            }
        }
        else
        {
            // Reply with NOT FOUND.
            p_response->header.code = COAP_CODE_404_NOT_FOUND;
        }
        uint32_t handle;
        err_code = internal_coap_message_send(&handle, p_response);

        COAP_TRC("[COAP]: Free mem, p_response->p_data = %p\r\n", p_response->p_data);
        UNUSED_VARIABLE(nrf51_sdk_mem_free(p_response->p_data));

        COAP_TRC("[COAP]: Free mem, p_response = %p\r\n", (uint8_t *)p_response);
        UNUSED_VARIABLE(nrf51_sdk_mem_free((uint8_t *)p_response));
#else   
        
        coap_message_t * p_error_response = NULL;        

        if (found_resource != NULL)
        {
            if (found_resource->callback != NULL)
            {
                if (((found_resource->permission) & (1 << ((p_message->header.code) - 1))) > 0) // Has permission for the requested CoAP method.
                {
                    COAP_MUTEX_UNLOCK();
                    
                    found_resource->callback(found_resource, p_message);
                    
                    COAP_MUTEX_LOCK();
                }
                else
                {
                    // create a response message.
                    err_code = create_response(&p_error_response, p_message, COAP_MESSAGE_DATA_MAX_SIZE);
                    if (err_code != NRF_SUCCESS)
                    {
                        app_error_notify(err_code, p_message);

                        return err_code;
                    }
                    p_error_response->header.code = COAP_CODE_405_METHOD_NOT_ALLOWED;
                }
            }
            else
            {
                // create a response message.
                err_code = create_response(&p_error_response, p_message, COAP_MESSAGE_DATA_MAX_SIZE);
                if (err_code != NRF_SUCCESS)
                {
                    app_error_notify(err_code, p_message);
                        
                    return err_code;
                }
                p_error_response->header.code = COAP_CODE_405_METHOD_NOT_ALLOWED;
            }
        }
        else
        {
            // Reply with NOT FOUND.
            err_code = create_response(&p_error_response, p_message, COAP_MESSAGE_DATA_MAX_SIZE);
            if (err_code != NRF_SUCCESS)
            {
                app_error_notify(err_code, p_message);

                return err_code;
            }
            p_error_response->header.code = COAP_CODE_404_NOT_FOUND;
        }
        
        if (p_error_response != NULL)
        {
            uint32_t handle;
            err_code = internal_coap_message_send(&handle, p_error_response);

            COAP_TRC("[COAP]: Free mem, p_response->p_data = %p\r\n", p_error_response->p_data);
            UNUSED_VARIABLE(nrf51_sdk_mem_free(p_error_response->p_data));

            COAP_TRC("[COAP]: Free mem, p_response = %p\r\n", (uint8_t *)p_error_response);
            UNUSED_VARIABLE(nrf51_sdk_mem_free((uint8_t *)p_error_response));
        }
        
#endif //#ifdef COAP_AUTOMODE
        
        COAP_TRC("[COAP]: Free mem, p_message = %p\r\n", (uint8_t *)p_message);
        UNUSED_VARIABLE(nrf51_sdk_mem_free((uint8_t *)p_message));

