xueliu/nRF51822/nrf51_iot_sdk_0.8.0_f1f6187/Nordic/nrf51/components/iot/coap/coap.c
    }
    else
    {
        COAP_TRC("[COAP]: CoAP message type: UNKNOWN\r\n");

        COAP_TRC("[COAP]: Free mem, p_message = %p\r\n", (uint8_t *)p_message);
        UNUSED_VARIABLE(nrf51_sdk_mem_free((uint8_t *)p_message));
    }

    COAP_TRC("[COAP]: << coap_transport_read\r\n");
    return err_code;
}

uint32_t coap_message_send(uint32_t * p_handle, coap_message_t * p_message)
{
    COAP_MUTEX_LOCK();

    uint32_t err_code = internal_coap_message_send(p_handle, p_message);
    
    COAP_MUTEX_UNLOCK();
    
    return err_code;
}

uint32_t coap_message_abort(uint32_t handle)
{
    
    return NRF_ERROR_NOT_SUPPORTED;
}

uint32_t coap_message_new(coap_message_t ** p_request, coap_message_conf_t * p_config)
{
    COAP_TRC("[COAP]: >> coap_request_create\r\n");

    COAP_MUTEX_LOCK();

    uint32_t err_code;

    // Allocate space for a new message.
    uint32_t size = sizeof(coap_message_t);
    err_code = nrf51_sdk_mem_alloc((uint8_t **)p_request, &size);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }
    memset(*p_request, 0, sizeof(coap_message_t));
    COAP_TRC("[COAP]: Alloc mem, *p_request = %p\r\n", (uint8_t *)(*p_request));


    // Allocate a scratch buffer for payload and options.
    size = COAP_MESSAGE_DATA_MAX_SIZE;
    err_code = nrf51_sdk_mem_alloc(&((*p_request)->p_data), &size);
    if (err_code != NRF_SUCCESS)
    {
        COAP_TRC("[COAP]: Allocation of message data buffer failed!\r\n");

        COAP_TRC("[COAP]: Free mem, *p_request = %p\r\n", (uint8_t *)(*p_request));
        UNUSED_VARIABLE(nrf51_sdk_mem_free((uint8_t *)(*p_request)));
        return err_code;
    }
    
    memset((*p_request)->p_data, 0, size);
    (*p_request)->data_len = size;
    
    COAP_TRC("[COAP]: Alloc mem, (*p_request)->p_data = %p\r\n", (uint8_t *)((*p_request)->p_data));

    // Set client port and initialize the message.
    if (is_request(p_config->code))
    {
        p_config->port.port_number = COAP_CLIENT_PORT;
    }
    else // RESPONSE
    {
        p_config->port.port_number = COAP_SERVER_PORT;
    }
    
    if (p_config->id == 0) // Message id is not set, generate one.
    {
        p_config->id = m_message_id_counter++;
    }
    
    err_code = coap_message_create(*p_request, p_config);

    COAP_MUTEX_UNLOCK();

    COAP_TRC("[COAP]: << coap_request_create, result = 0x%08lX\r\n", err_code);

    return err_code;
}

uint32_t coap_message_delete(coap_message_t * p_message)
{
    COAP_TRC("[COAP]: >> coap_request_delete\r\n");

    COAP_MUTEX_LOCK();

    //If this is a request free the coap_message_t and the data buffer.

    COAP_TRC("[COAP]: Free mem, p_message->p_data = %p\r\n", p_message->p_data);
    UNUSED_VARIABLE(nrf51_sdk_mem_free(p_message->p_data));

    COAP_TRC("[COAP]: Free mem, p_message = %p\r\n", (uint8_t *)p_message);
    UNUSED_VARIABLE(nrf51_sdk_mem_free((uint8_t *)p_message));


    COAP_MUTEX_UNLOCK();

    COAP_TRC("[COAP]: << coap_request_delete\r\n");

    return NRF_SUCCESS;
}

#ifdef COAP_AUTOMODE

static uint32_t internal_observer_notify(coap_resource_t * p_resource)
{
    // Fetch all observers which are subscribed to this resource.
    // Then send an update value too each observer.
    coap_observer_t * p_observer = NULL;
    while (coap_observe_server_next_get(&p_observer, p_observer, p_resource) != (NRF_ERROR_NOT_FOUND | IOT_COAP_ERR_BASE))
    {
        // Generate a message.
        coap_message_conf_t response_config;
        memset(&response_config, 0, sizeof(coap_message_conf_t));
        
        response_config.type = COAP_TYPE_NON;
        response_config.code = COAP_CODE_205_CONTENT;

        // Copy token.
        memcpy(&response_config.token[0], &p_observer->token[0], p_observer->token_len);
        // Copy token length.
        response_config.token_len = p_observer->token_len;
        response_config.port.port_number = COAP_SERVER_PORT;
        
        coap_message_t * p_response;
        uint32_t err_code = coap_message_new(&p_response, &response_config);
        if (err_code != NRF_SUCCESS)
        {
            return err_code;
        }
        
        err_code = coap_message_remote_addr_set(p_response, &p_observer->remote);
        if (err_code != NRF_SUCCESS)
        {
            (void)coap_message_delete(p_response);
            return err_code;
        }
        
        err_code = coap_message_opt_uint_add(p_response, COAP_OPT_OBSERVE, m_observe_sequence_number++);
        if (err_code != NRF_SUCCESS)
        {
            (void)coap_message_delete(p_response);
            return err_code;
        }
            
        err_code = coap_message_opt_uint_add(p_response, COAP_OPT_MAX_AGE, p_resource->expire_time);
        if (err_code != NRF_SUCCESS)
        {
            (void)coap_message_delete(p_response);
            return err_code;
        }
        
        COAP_MUTEX_UNLOCK();
        
        err_code = coap_resource_observe_payload_set(p_resource, p_observer->ct, p_response);
        
        COAP_MUTEX_LOCK();
        
        if (err_code != NRF_SUCCESS)
        {
            (void)coap_message_delete(p_response);
            return err_code;
        }
        
        uint32_t msg_handle;
        err_code = internal_coap_message_send(&msg_handle, p_response);
        if (err_code != NRF_SUCCESS)
        {
            (void)coap_message_delete(p_response);
            return err_code;
        }
        
        err_code = coap_message_delete(p_response);
        if (err_code != NRF_SUCCESS)
        {
            (void)coap_message_delete(p_response);
            return err_code;
        }
    }
    
    return NRF_SUCCESS;
}

uint32_t coap_observer_notify(coap_resource_t * p_resource)
{
    COAP_MUTEX_UNLOCK();

    uint32_t err_code = internal_observer_notify(p_resource);
    
    COAP_MUTEX_UNLOCK();
    
    return err_code;
}

static uint32_t resource_autonotify(coap_resource_t * p_current_resource)
{
    uint32_t err_code = NRF_SUCCESS;
    
    if (p_current_resource->p_front != NULL)
    {
        coap_resource_t * next_child = p_current_resource->p_front;
        do
        {
            err_code = resource_autonotify(next_child);
            if (err_code != NRF_SUCCESS)
            {
                return err_code;
            }
            next_child = next_child->p_sibling;
        } while (next_child != NULL);
    }
    
    // If the resource is observable, append 'obs;' token.
    if ((p_current_resource->permission & COAP_PERM_OBSERVE) > 0)
    {
        if (p_current_resource->expire_time <= (0 + COAP_AUTOMODE_OBSERVE_NOTIFY_DELTA_MAX_AGE))
        {
            p_current_resource->expire_time = p_current_resource->max_age;
            
