xueliu/nRF51822/nrf51_iot_sdk_0.8.0_f1f6187/Nordic/nrf51/components/iot/coap/coap.c
            (void)internal_observer_notify(p_current_resource);
        }
        else
        {
            p_current_resource->expire_time--;
        }
    }
    
    return err_code;
}

static uint32_t coap_observer_process_tick(void)
{
    coap_resource_t * root;
    
    COAP_MUTEX_LOCK();    
    
    uint32_t err_code = coap_resource_root_get(&root);
    
    if (err_code == NRF_SUCCESS)
    {
        resource_autonotify(root);
    }
    // If root was not found, we can safely return as there is 
    // nothing to process.
    
    COAP_MUTEX_UNLOCK();    

    return NRF_SUCCESS;
}
#endif

uint32_t coap_time_tick(void)
{
    COAP_MUTEX_LOCK();
    
#ifdef COAP_AUTOMODE
    uint32_t err_code = coap_observer_process_tick();
#endif
    
    // Loop through the message queue to see if any packets needs retransmission, or has timed out.
    coap_queue_item_t * p_item = NULL;
    while (coap_queue_item_next_get(&p_item, p_item) == NRF_SUCCESS)
    {
        if (p_item->timeout == 0)
        {                        
            // If there is still retransmission attempts left.
            if (p_item->retrans_count < COAP_MAX_RETRANSMIT_COUNT)
            {
                p_item->timeout     = p_item->timeout_val * 2;
                p_item->timeout_val = p_item->timeout;
                p_item->retrans_count++;
                
                // Retransmit the message.
                uint32_t err_code = coap_transport_write(&p_item->port, &p_item->remote, p_item->p_buffer, p_item->buffer_len);
                if (err_code != NRF_SUCCESS)
                {
                    app_error_notify(err_code, NULL);
                }
            }
            
            // No more retransmission attempts left, or max transmit span reached.
            if ((p_item->timeout > COAP_MAX_TRANSMISSION_SPAN) ||
                (p_item->retrans_count >= COAP_MAX_RETRANSMIT_COUNT))
            {
                
                COAP_MUTEX_UNLOCK();    
                
                p_item->callback(COAP_TRANSMISSION_TIMEOUT, p_item->p_arg, NULL);
                
                COAP_MUTEX_LOCK();
                
                COAP_TRC("[COAP]: Free mem, p_item->p_buffer = %p\r\n", p_item->p_buffer);
                UNUSED_VARIABLE(nrf51_sdk_mem_free(p_item->p_buffer));
                
                (void)coap_queue_remove(p_item);
            }
        }
        else
        {
            p_item->timeout--;
        }
    }
    
    COAP_MUTEX_UNLOCK();
    
    return NRF_SUCCESS;
}
